{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "trainable": true, "activation": "softmax"}}]}